<template>
  <Layout>
    <h1 class="text-3xl font-bold mt-16">من نحن ؟</h1>
    <p class="mt-4">
      السلام عليكم,<br /><br />
      أنت في هذا المكان بسبب الفضول حول من يقف وراء مدونة <span class="font-bold">سينتاكس</span> التقنية. بالنسبة لنا غير مهم التعريف بأنفسنا قدر ما يهمنا أن يفهم زوار هاته المدونة المبدأ الذي بُنيت عليه و الهدف الأسمى الذي نود الوصول إليه من خلالها.<br /><br />
      أكيد لدى دخولك للمدونة صادفت إقتباسين  (إقتباس لـ<span class="font-bold">أنس بن مالك</span>, إقتباس من وصية مبرمج حكيم لإبنه لـ<span class="font-bold">خالد السعداني</span>) التي تحمل في طياتها المبدأ و الهدف الذي نصبوا إليه. <br /><br />
      المبدأ ببساطة <span class="font-bold">كما تلقيت العلم من غيرك, ألقه على غيرك و لا تحتكره لنفسك</span>. بعد تجربة أراها ناجحة في نشر معارفنا في البرمجة و مجالاتها من خلال الفيديوهات على منصة يوتيوب و يُمكنك معاينة قنواتنا من خلال الروابط التالية : <g-link to="https://www.youtube.com/c/algorithmCoding" class="font-bold">Algorithm Academy Channel</g-link>, <g-link to="https://www.youtube.com/channel/UC03jVHQxJ-4dWJ97mPPZ_pQ" class="font-bold">Galaxy Prog Channel</g-link>. إرتأينا إلى توفير هاته المعارف أيضا بشكل كتابي للأشخاص التي تُحب القراءة أكـثر من مشاهدة الفيديوهات.<br /><br />
      السبب الذي جعلنا نفتح قنوات اليوتيوب هو نفسه السبب الذي دفعنا إلى إنشاء مدونة سينتاكس و هو إثـراء المحتوى العربي في مجال البرمجة و مجالاتها. فحجم المحتوى العربي مقارنة بعدد ناطقي اللغة العربية هو رقم هزيل و مُجحف, فإثراء المحتوى العربي كما و كيفا و نوعا هو مسؤوليتنا جميعا للحفاظ على هويتنا و لغتنا العربية لتمكين الجيل الجديد الذي نبني عليه آمالا للوصول للمعرفة و إستغلالها في خدمة المجتمعات العربية و الإسلامية.<br /><br />

      نحن شُبان من المغرب العربي (جزائريين) وهبنا جزء من وقتنا و حياتنا من أجل تحقيق هذا الهدف الأسمى من خلال العمل بالمبدأ الذي نؤمن انه هو المفتاح في تحقيق ذلكـ.<br /><br />
      أدامكم الله ذخرا للمحتوى العربي و اللغة العربية.
    </p>
  </Layout>
</template>

<script>
export default {
  metaInfo: {
    title: 'من نحن ؟'
  }
}
</script>

<style scoped>
h1 {
  color: var(--title-color);
}

a {
  color: #6fb451;
}
</style>
