<template>
  <Layout>
    <h1 class="text-3xl font-bold mt-16">سياسية الخصوصية</h1>
    <p class="mt-8">
      كلنا نهتم بشأن معلوماتنا و خصوصيتنا على شبكة الأنترنت, بما أنك في هاته الصفحة فأنت شخص يهتم لذلك و نحن نقدر خوفك و إهتمامك. <br /><br />
      لهذا قمنا في هاته الصفحة بتوضيح سياسة الخصوصية في مدونة سينتاكس حتى تفهم ما الذي يحدث من دخولك إلى غاية خروجك منها. <br /><br />
      <span class="font-bold">نحن لا نقوم بتخزين أي نوع من البيانات في مدونتنا</span>.<br /><br />
      الطريقة التي برمجنا بها المدونة لا تسمح بذلكـ.
      ليس لدينا مكان لتخزين البيانات. حتى أنه ليس لدينا اي قاعدة بيانات . فنحن نعتمد على ملفات Markdown في تخزين المقالات.<br /><br />
      لا نستخدم إضافات مثل Google Analytics و ليس لدينا أي أطراف ثالثة نستخدمها في المدونة, لا نمتلك نظام تعليقات أو نظام تسجيل/دخول و بالتالي في هاته المدونة لا توجد حاليا أي طريقة لجمع البيانات عنك.<br /><br />
      عادة إنشاء هاته الصفحة يكون مٌتعلق بالربح من إعلانات أدسنس (صفحة مطلوبة من أجل تحقيق الربح). قمنا بإنشاء هاته الصفحة لغرض واحد و هو إخبارك أن مدونتنا أبسط من شكلها التي عليه . فلا نريد إحصائيات و لا نريد تفعيل الربح من الإعلانات . فقط علوم و معارف نشاركها معكم لإثراء المحتوى العربي.
    </p>
  </Layout>
</template>

<script>
export default {
  metaInfo: {
    title: 'سياسة الخصوصية'
  }
}
</script>

<style>
h1 {
  color: var(--title-color);
}
</style>
